app/Models/ModelRekening.php

   public function AllData()
   {
       return $this->db->table('tbl_rekening')
              ->get()->getResultArray();
---
SELECT *
FROM `tbl_rekening`