app/Models/ModelKasMasjid.php

SELECT *
FROM `tbl_kas_masjid`
---
   public function AllData()
   {
      return $this->db->table('tbl_kas_masjid')
         ->get()->getResultArray();

SELECT *
FROM `tbl_kas_masjid`
WHERE month(tanggal) = '9'
AND year(tanggal) = '2023'
---
   public function AllDataBulanan($bulan, $tahun)
   {
      return $this->db->table('tbl_kas_masjid')
         ->where('month(tanggal)', $bulan)
         ->where('year(tanggal)', $tahun)
         ->get()->getResultArray();