app/Models/ModelKasSosial.php

   public function AllData()
   {
      return $this->db->table('tbl_kas_sosial')
         ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_sosial`

   public function AllDataBulanan($bulan, $tahun)
   {
      return $this->db->table('tbl_kas_sosial')
         ->where('month(tanggal)', $bulan)
         ->where('year(tanggal)', $tahun)
         ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_sosial`
WHERE month(tanggal) = '9'
AND year(tanggal) = '2023'