app/Views/v_template.php

SELECT *
FROM `tbl_setting`
---
<body class="hold-transition layout-top-nav">
  <?php
    $db = \Config\Database::connect();
    $web = $db->table('tbl_setting')->get()->getRowArray()